[
    {
        "title": "Software Engineer",
        "subtitle": "Red Ventures - RVGT",
        "date": "October 2025 - Present",
        "description": "Red Ventures Growth & Transformation (RVGT) is a Red Ventures company that drives measurable growth for the world’s leading financial institutions — transforming how they acquire, engage, and retain customers.",
        "bullets": []
    },
    {
        "title": "Software Engineer III",
        "subtitle": "MedShift - Velocity",
        "date": "May 2024 - October 2025",
        "description": "Velocity by MedShift is an extensive customer, product, payment, and commission management platform for the medical device industry.",
        "bullets": [
            "Developed two B2B medtech SPAs using Python, Django, Django REST Framework, Vue, React, and Tailwind.",
            "Owned client onboarding and custom development initiatives end-to-end, streamlining processes to reduce time-to-onboard from weeks to days.",
            "Led end-to-end custom integrations with partner APIs (e.g., Stripe, Firebase, Metabase), implementing idempotent workflows to ensure reliable, repeatable data syncs."
        ]
    },
    {
        "title": "Full Stack & DevOps Engineer",
        "subtitle": "Punchmark",
        "date": "June 2021 - May 2024",
        "description": "Punchmark is a SaaS platform providing an end-to-end e-commerce solution for the jewelry industry.",
        "bullets": [
            "Drove development for an e-commerce platform using PHP, JavaScript (React), and Sass in a small team environment.",
            "Managed end-to-end platform operations including DevOps, security, and database administration.",
            "Led incident response to a critical security breach from investigation to implementation, delivering an entire authentication service overhaul within two weeks.",
            "Investigated and resolved security vulnerabilities using Burp Suite.",
            "Owned development of an extendable data-ingestion framework capable of efficiently handling terabytes of data per hour, resulting in a greater than 50% increase in performance.",
            "Orchestrated cloud deployments on AWS with Ansible and Docker."
        ]
    }
]
